eisup_2019_docmng_integration/src/InformationRegisters/ПредметыКонтролируемыхСделок/ПредметыКонтролируемыхСделок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПредметыКонтролируемыхСделок</name>
  <resources>
    <name>ЯвляетсяТоваромМировойБиржевойТорговли</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОблагаетсяНДПИПоПроцентнойСтавке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодПоТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПоОКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПоОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПредметСделки</name>
    <type>
      <types>CatalogRef.ОбъектыСтроительства</types>
      <types>CatalogRef.ОсновныеСредства</types>
      <types>CatalogRef.НематериальныеАктивы</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ПредметыКонтролируемыхСделок/Forms/ФормаЗаписи/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(Запись, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	
	ДоступностьКлючевыхЗаписей = Истина;
	Если Параметры.Свойство("ДоступностьКлючевыхЗаписей") Тогда
		ДоступностьКлючевыхЗаписей = Параметры.ДоступностьКлючевыхЗаписей;
	КонецЕсли;
	
	ЭтаФорма.Элементы.ПредметСделки.Доступность 							= ДоступностьКлючевыхЗаписей;	
	ЭтаФорма.Элементы.ЯвляетсяТоваромМировойБиржевойТорговли.Доступность 	= ДоступностьКлючевыхЗаписей;	
	
	ОтметкаЗаполнения = Мин(НЕ Макс(ЗначениеЗаполнено(Запись.КодПоОКВЭД),ЗначениеЗаполнено(Запись.КодПоОКП),ЗначениеЗаполнено(Запись.КодПоТНВЭД)),Не ДоступностьКлючевыхЗаписей);
	
	ЭтаФорма.Элементы.КодПоОквэд.АвтоОтметкаНезаполненного 	= ОтметкаЗаполнения;
	ЭтаФорма.Элементы.КодПоОКП.АвтоОтметкаНезаполненного 	= ОтметкаЗаполнения;
	ЭтаФорма.Элементы.КодПоТНВЭД.АвтоОтметкаНезаполненного 	= ОтметкаЗаполнения;
	
КонецПроцедуры
